[
  {
    "id": 1,
    "company": "Deloitte",
    "position": "Consultant",
    "startDate": "2023-11",
    "endDate": "2024-07",
    "description": "Titan Project – Improved project alignment with client goals by ensuring 100% requirement accuracy during the discovery phase. VGuard Project – Designed and implemented core modules, APIs, including a real-time notification engine, attendance tracking system, and expense management feature, improving user experience and operational efficiency.",
    "skills": ["React", "Node.js", "TypeScript", "API Design", "Project Management"],
    "order": 1,
    "createdAt": "2024-08-01T00:00:00.000Z"
  },
  {
    "id": 2,
    "company": "BHIVE Alts",
    "position": "Full Stack Developer",
    "startDate": "2022-06",
    "endDate": "2023-11",
    "description": "Developed BHIVE Alts App – Solely built and launched an investor-focused app, driving user engagement and supporting company growth. Project Lead for Payment Module – Led development of a payment module, contributing to combined revenue generation of ₹60 crore. Tech Stack Optimization – Introduced improvements to the tech stack, enhancing app performance and reliability.",
    "skills": ["React", "Node.js", "Payment Integration", "App Development", "Tech Leadership"],
    "order": 2,
    "createdAt": "2023-12-01T00:00:00.000Z"
  },
  {
    "id": 3,
    "company": "Webbirth",
    "position": "Software Engineer",
    "startDate": "2021-09",
    "endDate": "2022-06",
    "description": "Built mobile applications for six projects using React Native and Flutter. Enhanced solution reliability by 25% through leading backend development with Node.js and Laravel. Worked across multiple technologies to meet varied client requirements in a dynamic startup environment.",
    "skills": ["React Native", "Flutter", "Node.js", "Laravel", "Mobile Development"],
    "order": 3,
    "createdAt": "2022-07-01T00:00:00.000Z"
  },
  {
    "id": 4,
    "company": "Civil Engineering System",
    "position": "Full Stack Developer",
    "startDate": "2020-06",
    "endDate": "2021-07",
    "description": "Supported development and testing of in-house applications, focusing on PHP-based backend services and frontend development with React and theming using Bootstrap. Contributed to UI/UX design to improve the customer-facing platform.",
    "skills": ["React", "PHP", "Bootstrap", "UI/UX Design", "Testing"],
    "order": 4,
    "createdAt": "2021-08-01T00:00:00.000Z"
  }
]
